{
    "items": [
        {
            "id": 1,
            "name": "Old Key",
            "description": "You found this key on the table in the parlour. It opens a door somewhere",
            "long_description": "A tarnished brass key, remnants of a bygone era. Its intricate design whispers of secrets held within forgotten doors, echoing the nostalgia of a time long past",
            "item_location": 1,
            "location_description": "You see an Old Key on a table"
        },
        {
            "id": 2,
            "name": "Doll Head",
            "description": "Head of a doll. It's missing its body",
            "long_description": "Lifeless eyes peer through faded curls, a relic of forgotten playtimes, evoking a haunting sense of nostalgia in the eerie atmosphere of the decaying room",
            "item_location": 9,
            "location_description": "You see a Doll Head on a book shelf"

        },
        {
            "id": 3,
            "name": "Doll Body",
            "description": "Body of a doll. It's missing its head",
            "long_description": "Plastic limbs and faded fabric dress telling tales of forgotten tea parties and childhood innocence. Amidst the dust, it silently echoes the passage of time and memories left behind",
            "item_location": 9,
            "location_description": "You see a Doll Body on a table"
        },
        {
            "id": 4,
            "name": "Doll",
            "description": "An old Doll. Not sure where to use this",
            "long_description": " Its glassy eyes hold a hint of melancholy, a silent witness to the bygone days when laughter filled the grand rooms of the mansion",
            "is_combined_item": true,
            "combination": [
                2,
                3
            ],
            "combine_success_description": "You put together the Doll Head and Doll Body, completing the full Doll"
        },
        {
            "id": 5,
            "name": "Puzzle Piece",
            "description": "A missing puzzle piece, it kind of looks like someone's eye",
            "long_description": "A lone puzzle piece, its vibrant artwork adrift in a sea of forgotten games",
            "item_location": 6,
            "location_description": "You see a Puzzle Piece on the dusty cracked wood floor"
        },
        {
            "id": 6,
            "name": "Dirty Cloth",
            "description": "A Dirty Cloth, smells like rotting flesh",
            "long_description": " Stains and dust intertwine with the fabric, bearing witness to years of neglect. The cloth, once vibrant, now tells a silent story of time's passage and the faded elegance of the vintage setting",
            "item_location": 5,
            "location_description": "You see a Dirty Cloth on the dining table"
        },
        {
            "id": 7,
            "name": "Candle",
            "description": "A used white wax candle",
            "long_description": "A partially melted 80s wax candle stands on an ornate holder in the mansion. Its wick, frozen in time, whispers of forgotten gatherings",
            "item_location": 7,
            "location_description": "You see a white Candle from the corner of your eye, on top of the shelf"
        },
        {
            "id": 8,
            "name": "Lighter",
            "description": "A lighter used to light things on fire",
            "long_description": "its surface worn and marked by time, rests on a dusty mantelpiece in the mansion",
            "item_location": 0,
            "location_description": "You see the Lighter on the table"
        },
        {
            "id": 9,
            "name": "Lit Candle",
            "description": "A lit candle",
            "long_description": "The warm glow of a scented candle fills the air in the mansion. Its flame dances gracefully atop the wick, casting soft shadows on the retro wallpaper",
            "is_combined_item": true,
            "combination": [
                7,
                8
            ],
            "combine_success_description": "You light the candle with the lighter, creating a Lit Candle"
        },
        {
            "id": 10,
            "name": "Pendant",
            "description": "A shiny green Pendant, looks like it belongs to someone",
            "long_description": "Suspended from a delicate chain, catches the light in the mansion. The emerald hue, faded yet elegant, dangles with a hint of mystery, echoing the era's fashion",
            "item_location": 8,
            "location_description": "You spot a Pendant in between the wood planks on the floor."
        },
        {
            "id": 11,
            "name": "Rusted Knife",
            "description": "A rusty knife, it can barely cut anything",
            "long_description": "Neglected and forsaken, its corroded blade tells tales of a time when it may have been a kitchen companion or a forgotten tool in the grand estate",
            "item_location": 4,
            "location_description": "There's a Rusted Knife on the marble countertop"
        }
    ]
}