{
    "rooms": [
        {
            "id": 1,
            "name": "Lobby",
            "description": "The mansion's lobby exuded an eerie ambiance. Antique furniture stood draped in dusty shrouds, their forms distorted by the dim light. Faded wallpaper bore silent witness to bygone grandeur. Candles flickered with trepidation, casting macabre shadows, and a sense of foreboding hung heavy in the air.",
            "long_description": "The mansion's lobby, a cavernous chamber, oozed with an unsettling aura. Antique furniture, swathed in tattered drapes, stood frozen in time, their ornate carvings and faded upholstery whispering tales of opulence long past. The wallpaper, once regal, now hung in tatters, bearing the weight of forgotten memories. Candles, their flames flickering with trepidation, lined the mantle, casting grotesque shadows that danced on the frayed edges of a worn carpet. The air was thick with an uncanny stillness, laden with secrets waiting to be unearthed. It was a chilling prologue to the haunted mysteries that lay hidden within the mansion's depths."
        },
        {
            "id": 2,
            "name": "Hallway",
            "description": "The dimly lit mansion hallway exuded an unsettling aura. Faded, peeling wallpaper revealed eerie, distorted faces. Antique portraits lined the walls, their eyes tracking your every move. Dusty chandeliers cast flickering shadows, and the air was heavy with an oppressive silence, broken only by the occasional, distant whisper.",
            "long_description": "The mansion's hallway, a twisted corridor, was bathed in an eerie darkness. Its walls bore cracked, peeling wallpaper, where grotesque, distorted faces seemed trapped in silent agony. Antique portraits hung ominously, their forgotten subjects' eyes tracking every movement. Dusty chandeliers swayed, casting unsettling, wavering shadows across the worn carpet. The air hung heavy with secrets, and an unsettling silence prevailed, punctuated only by distant, ghostly whispers—a chilling symphony that resonated throughout the forsaken passage."
        },
        {
            "id": 3,
            "name": "Bedroom",
            "description": "The bedroom exuded an eerie vibe. Tattered curtains barely held back the moonlight, casting eerie shadows on decrepit furniture. A cracked mirror reflected a distorted, unsettling image. Dust-covered toys hinted at forgotten innocence, while an oppressive stillness hung heavy in the room.",
            "long_description": "The bedroom, a forsaken sanctum, radiated an unsettling atmosphere. Tattered curtains struggled to contain the pale moonlight, casting elongated, ghostly shadows on the decaying remnants of furniture. A cracked mirror on the wall reflected a distorted, unsettling image of the room's eerie past. Dust-covered toys lay strewn about, their silent presence hinting at forgotten innocence now lost to time. The air was thick with an oppressive stillness, as if the room itself held its breath, guarding the darkest secrets of the mansion. It was a chamber of haunted memories and unsettling mysteries, where the past clung to the present like a malevolent specter.",
            "is_ending_room": true
        }
    ]
}